In [10]:

#Pandas Index Object

In [31]:
import numpy as np
import pandas as pd

In [32]:
ind = pd.Index([20, 34, 57, 7, 1, 8])

In [33]:
ind

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [34]:
ind[1]

34

In [35]:
ind[::]

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [36]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

6 (6,) 1 int64

In [37]:
ind[1] = 0

TypeError: Index does not support mutable operations

In [38]:

#Ufuncs

In [39]:
rng = np.random.RandomState(15)
ser = pd.Series(rng.randint(0,10,4))
ser

0    8
1    5
2    5
3    7
dtype: int32

In [40]:
dfr = pd.DataFrame(rng.randint(0, 10, (5, 4)),
                  columns = ['A','B', 'C','D'])
dfr

   A  B  C  D
0  0  7  5  6
1  1  7  0  4
2  9  7  5  3
3  6  8  2  1
4  1  0  5  2

In [41]:
np.exp(ser)

0    2980.957987
1     148.413159
2     148.413159
3    1096.633158
dtype: float64

In [42]:
np.sin(dfr * np.pi/4)

          A             B         C             D
0  0.000000 -7.071068e-01 -0.707107 -1.000000e+00
1  0.707107 -7.071068e-01  0.000000  1.224647e-16
2  0.707107 -7.071068e-01 -0.707107  7.071068e-01
3 -1.000000 -2.449294e-16  1.000000  7.071068e-01
4  0.707107  0.000000e+00 -0.707107  1.000000e+00

In [43]:

#Universal Functions: Index Alignment

In [44]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
print(area)
population

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [45]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [46]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [47]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
print(A)
print(B)
A + B

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [48]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [49]:

#Data Wrangling

In [52]:
data = {"Province":["FL","FL","NH","NH","ZH"],
       "Year":[2013, 2014, 2013, 2014, 2014],
       "Literacy":[0.2, 0.1, 0.5, 0.3, 0.5]}

df = pd.DataFrame(data, columns=["Year", "Province" ,"Literacy"])

df['nonsense'] = df.Year / df.Literacy

df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])

In [55]:
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [54]:
df2 = pd.DataFrame({"Province": ["FL", "NH", "ZH"], "Population": ["100000", "200000", "300000"]})

In [56]:
df2

  Province Population
0       FL     100000
1       NH     200000
2       ZH     300000

In [57]:
df.merge(df2)

   Year Province  Literacy      nonsense  Serie_aligned Population
0  2013       FL       0.2  10065.000000              0     100000
1  2014       FL       0.1  20140.000000              1     100000
2  2013       NH       0.5   4026.000000              2     200000
3  2014       NH       0.3   6713.333333              3     200000
4  2014       ZH       0.5   4028.000000              4     300000

In [58]:
df3 = pd.DataFrame({"province": ["FL", "NH"], "Population": ["100000", "200000"]})
df3
df.merge(df3, right_on='province', left_on='Province')

   Year Province  Literacy      nonsense  Serie_aligned province Population
0  2013       FL       0.2  10065.000000              0       FL     100000
1  2014       FL       0.1  20140.000000              1       FL     100000
2  2013       NH       0.5   4026.000000              2       NH     200000
3  2014       NH       0.3   6713.333333              3       NH     200000

In [59]:
df4 = pd.DataFrame({"Province": ["FL", "NH", "UT"], "Population": ["100000", "200000", "50000"]})
df.merge(df4, how='outer')

     Year Province  Literacy      nonsense  Serie_aligned Population
0  2013.0       FL       0.2  10065.000000            0.0     100000
1  2014.0       FL       0.1  20140.000000            1.0     100000
2  2013.0       NH       0.5   4026.000000            2.0     200000
3  2014.0       NH       0.3   6713.333333            3.0     200000
4  2014.0       ZH       0.5   4028.000000            4.0        NaN
5     NaN       UT       NaN           NaN            NaN      50000

In [60]:
df5 = pd.DataFrame({"Province": ["FL", "NH", "FL"], "Population": ["100000", "200000", "50000"]})
print(df)
df.merge(df5, how='outer')

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

   Year Province  Literacy      nonsense  Serie_aligned Population
0  2013       FL       0.2  10065.000000              0     100000
1  2013       FL       0.2  10065.000000              0      50000
2  2014       FL       0.1  20140.000000              1     100000
3  2014       FL       0.1  20140.000000              1      50000
4  2013       NH       0.5   4026.000000              2     200000
5  2014       NH       0.3   6713.333333              3     200000
6  2014       ZH       0.5   4028.000000              4        NaN

In [61]:

#Combining data with overlap

In [62]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
                     index=['f', 'e', 'd', 'c', 'b', 'a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                 index=['f', 'e', 'd', 'c', 'b', 'a'])

In [63]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [64]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [65]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a), index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [66]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64